satisfy-simple-example/src/test/resources/GetWeatherInformationRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
    <soapenv:Header/>
    <soapenv:Body>
        <weat:GetWeatherInformation/>
    </soapenv:Body>
</soapenv:Envelope>