examples-results/HsacExamples.SlimTests.HttpTests.HttpPost1Test.html

<html><head><title>HsacExamples.SlimTests.HttpTests.HttpPost1Test</title><meta http-equiv='Content-Type' content='text/html;charset=UTF-8'/><link rel='stylesheet' type='text/css' href='css/fitnesse.css'/><script src='javascript/jquery-1.11.3.min.js' type='text/javascript'></script><script src='javascript/fitnesse.js' type='text/javascript'></script></head><body><header><h2>HsacExamples.SlimTests.HttpTests.HttpPost1Test</h2></header><article><br/><h2>Body in Wiki</h2>
<br/>Send a HTTP POST supplying the content to post in a variable so the script table does not have newlines in its cells. <br/><br/><span class="meta">variable defined: POST_BODY= {{{
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:GetCityWeatherByZIP xmlns:ns1="http://ws.cdyne.com/WeatherWS/"&gt;
      &lt;ns1:ZIP&gt;90210&lt;/ns1:ZIP&gt;
    &lt;/ns1:GetCityWeatherByZIP&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
}}} </span>
<br/><br/><table>
	<tr class="slimRowTitle">
		<td>script</td>
		<td colspan="3"><span class="pass">xml http test</span></td>
	</tr>
	<tr class="slimRowColor4">
		<td><span class="fail">post</span></td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:GetCityWeatherByZIP xmlns:ns1="http://ws.cdyne.com/WeatherWS/"&gt;
      &lt;ns1:ZIP&gt;90210&lt;/ns1:ZIP&gt;
    &lt;/ns1:GetCityWeatherByZIP&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td><a href="http://wsf.cdyne.com/WeatherWS/Weather.asmx">http://wsf.cdyne.com/WeatherWS/Weather.asmx</a></td>
	</tr>
	<tr class="slimRowColor0">
		<td>check</td>
		<td>response status</td>
		<td colspan="2">[<span class="diff">5</span>00] <span class="fail">expected [</span><span class="diff">2</span><span class="fail">00]</span></td>
	</tr>
	<tr class="slimRowColor9">
		<td>show</td>
		<td colspan="3">response</td>
	<td><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
    &lt;soap:Body&gt;
        &lt;soap:Fault&gt;
            &lt;faultcode&gt;soap:Server&lt;/faultcode&gt;
            &lt;faultstring&gt;Server was unable to process request. ---&amp;gt; Timeout expired.  The timeout period elapsed prior to obtaining a connection from the pool.  This may have occurred because all pooled connections were in use and max pool size was reached.&lt;/faultstring&gt;
            &lt;detail/&gt;
        &lt;/soap:Fault&gt;
    &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;
</pre></td></tr>
	<tr class="slimRowColor9">
		<td>show</td>
		<td colspan="3">response headers</td>
	<td><table class="hash_table">
	<tr class="hash_row">
		<td class="hash_key">Cache-Control</td>
		<td class="hash_value">private</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Content-Type</td>
		<td class="hash_value">text/xml; charset=utf-8</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Server</td>
		<td class="hash_value">Microsoft-IIS/7.5</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">X-AspNet-Version</td>
		<td class="hash_value">2.0.50727</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">X-Powered-By</td>
		<td class="hash_value">ASP.NET</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Date</td>
		<td class="hash_value">Wed, 02 Nov 2016 22:14:41 GMT</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Content-Length</td>
		<td class="hash_value">577</td>
	</tr>
</table></td></tr>
	<tr class="slimRowColor5">
		<td>register prefix</td>
		<td>weather</td>
		<td>for namespace</td>
		<td><a href="http://ws.cdyne.com/WeatherWS/">http://ws.cdyne.com/WeatherWS/</a></td>
	</tr>
	<tr class="slimRowColor0">
		<td>check</td>
		<td>xPath</td>
		<td>//weather:City/text()</td>
		<td>Beverly Hills <span class="error"><div>SOAP fault received: <pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;<br/>    &lt;soap:Body&gt;<br/>        &lt;soap:Fault&gt;<br/>            &lt;faultcode&gt;soap:Server&lt;/faultcode&gt;<br/>            &lt;faultstring&gt;Server was unable to process request. ---&amp;gt; Timeout expired.  The timeout period elapsed prior to obtaining a connection from the pool.  This may have occurred because all pooled connections were in use and max pool size was reached.&lt;/faultstring&gt;<br/>            &lt;detail/&gt;<br/>        &lt;/soap:Fault&gt;<br/>    &lt;/soap:Body&gt;<br/>&lt;/soap:Envelope&gt;<br/></pre></div></span></td>
	</tr>
</table>
</article></body></html>